-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Хост: h111707468.mysql
-- Время создания: Авг 29 2022 г., 13:03
-- Версия сервера: 5.6.51-91.0
-- Версия PHP: 7.4.20

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `h111707468_test`
--

-- --------------------------------------------------------

--
-- Структура таблицы `cscart_oblast`
--
-- Создание: Авг 28 2022 г., 12:59
--

DROP TABLE IF EXISTS `cscart_oblast`;
CREATE TABLE `cscart_oblast` (
  `state` varchar(300) COLLATE utf8_bin NOT NULL,
  `code` varchar(200) COLLATE utf8_bin NOT NULL,
  `id` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Дамп данных таблицы `cscart_oblast`
--

INSERT INTO `cscart_oblast` (`state`, `code`, `id`) VALUES
('Оренбургская обл.', 'ORE', 1),
('Нижегородская обл.', 'NIZ', 2),
('Нижегородская область', 'NIZ', 3),
('Красноярский край', 'KYA', 4),
('Ханты-Мансийский автономный округ - Югра', 'KHM', 5),
('Марий Эл респ.', 'ME', 6),
('Пензенская область', 'PNZ', 7),
('Татарстан респ.', 'TA', 8),
('Волгоградская обл.', 'VGG', 9),
('Волгоградская область', 'VGG', 10),
('Саратовская область', 'SAR', 11),
('Самарская область', 'SAM', 12),
('Самарская обл.', 'SAM', 13),
('Башкортостан', 'BA', 14),
('Оренбургская область', 'ORE', 15),
('Башкортостан респ.', 'BA', 16),
('Республика Северная Осетия - Алания', 'SE', 17),
('Татарстан', 'TA', 18),
('Краснодарский край', 'KDA', 19),
('Ростовская область', 'ROS', 20),
('Ростовская обл.', 'ROS', 21),
('Приморский край', 'PRI', 22),
('Ставропольский край', 'STA', 23),
('Кабардино-Балкарская респ.', 'KB', 24),
('Карачаево-Черкесская респ.', 'KC', 25),
('Саратовская обл.', 'SAR', 26),
('Московская обл.', 'MOS', 27),
('Коми респ.', 'KO', 28),
('Московская область', 'MOS', 29),
('Челябинская область', 'CHE', 30),
('Еврейская автономная обл.', 'YEV', 31),
('Ярославская обл.', 'YAR', 32),
('Вологодская область', 'Россия', 33),
('Орловская область', 'ORL', 34),
('Иркутская область', 'IRK', 35),
('Крым респ.', 'KRY', 36),
('Свердловская обл.', 'SVE', 37),
('Пермский край', 'PER', 38),
('Москва', 'MOW', 39),
('Республика Крым', 'KRY', 40),
('Алтайский край', 'AL', 41),
('Республика Хакасия', 'KK', 42),
('Иркутская обл.', 'IRK', 43),
('Псковская область', 'PSK', 44),
('Архангельская обл.', 'ARK', 45),
('Тюменская область', 'TYU', 46),
('Тюменская обл.', 'TYU', 47),
('Омская область', 'OMS', 48),
('Калужская обл.', 'KLU', 49),
('Кемеровская область - Кузбасс ', 'KEM', 50),
('Ленинградская область', 'LEN', 51),
('Смоленская область', 'SMO', 52),
('Новосибирская область', 'NVS', 53),
('Владимирская обл.', 'VLA', 54),
('Ямало-Ненецкий автономный округ', 'NEN', 55),
('Санкт-Петербург', 'SPE', 56),
('Ленинградская обл.', 'LEN', 57),
('Адыгея респ.', 'Россия', 58),
('Белгородская обл.', 'BEL', 59),
('Адыгея', 'Россия', 60),
('Ивановская область', 'IVA', 61),
('Марий Эл', 'ME', 62),
('Чувашия', 'CU', 63),
('Чувашия респ.', 'CU', 64),
('Новосибирская обл.', 'NVS', 65),
('Хабаровский край', 'KHA', 66),
('Свердловская область', 'SVE', 67),
('Воронежская область', 'VOR', 68),
('Челябинская обл.', 'CHE', 69),
('Воронежская обл.', 'VOR', 70),
('Саха респ. (Якутия)', 'SA', 71),
('Рязанская обл.', 'RYA', 72),
('Владимирская область', 'VLA', 73),
('Курганская область', 'KGN', 74),
('Республика Саха (Якутия)', 'SA', 75),
('Сахалинская обл.', 'SAK', 76),
('Амурская область', 'AMU', 77),
('Забайкальский край', 'ZAB', 78),
('Тверская область', 'TVE', 79),
('Ярославская область', 'YAR', 80),
('Амурская обл.', 'AMU', 81),
('Ханты-Мансийский авт. округ', 'KHM', 82),
('Брянская область', 'BRY', 83),
('Камчатский край', 'KAM', 84),
('Рязанская область', 'RYA', 85),
('Белгородская область', 'BEL', 86),
('Астраханская область', 'AST', 87),
('Кировская обл.', 'KIR', 88),
('Липецкая область', 'LIP', 89),
('Омская обл.', 'OMS', 90),
('Калининградская обл.', 'KGD', 91),
('Магаданская обл.', 'MAG', 92),
('Магаданская область', 'MAG', 93),
('Чукотский автономный округ', 'CHU', 94),
('Псковская обл.', 'PSK', 95),
('Калужская область', 'KLU', 96),
('Мурманская область', 'MUR', 97),
('Вологодская обл.', 'Россия', 98),
('Томская обл.', 'TOM', 99),
('Томская область', 'TOM', 100),
('Кемеровская область', 'KEM', 101),
('Астраханская обл.', 'AST', 102),
('Пензенская обл.', 'PNZ', 103),
('Липецкая обл.', 'LIP', 104),
('Калининградская область', 'KGD', 105),
('Ямало-Ненецкий авт. округ', 'NEN', 106),
('Архангельская область', 'Россия', 107),
('Сахалинская область', 'SAK', 108),
('Брянская обл.', 'BRY', 109),
('Тверская обл.', 'TVE', 110),
('Республика Бурятия', 'BU', 111),
('Республика Алтай', 'Россия', 112),
('Алтай респ.', 'Россия', 113),
('Карачаево-Черкесия', 'KC', 114),
('Республика Карелия', 'KR', 115),
('Мурманская обл.', 'MUR', 116),
('Курская область', 'KRS', 117),
('Курская обл.', 'KRS', 118),
('Ульяновская область', 'ULY', 119),
('Новгородская область', 'NGR', 120),
('Кабардино-Балкария', 'KB', 121),
('Кировская область', 'KIR', 122),
('Тамбовская область', 'TAM', 123),
('Калмыкия', 'KL', 124),
('Хакасия респ.', 'KK', 125),
('Тамбовская обл.', 'TAM', 126),
('Еврейская автономная область', 'YEV', 127),
('Северная Осетия респ.', 'SE', 128),
('Чеченская респ.', 'CE', 129),
('Орловская обл.', 'ORL', 130),
('Смоленская обл.', 'SMO', 131),
('Дагестан', 'DA', 132),
('Карелия респ.', 'KR', 133),
('Ненецкий авт. округ', 'NEN', 134),
('Бурятия респ.', 'BU', 135),
('Курганская обл.', 'KGN', 136),
('Удмуртия', 'UD', 137),
('Мордовия', 'MO', 138),
('Ульяновская обл.', 'ULY', 139),
('Тульская область', 'TUL', 140),
('Чеченская Республика', 'CE', 141),
('Дагестан респ.', 'DA', 142),
('Ингушетия', 'IN', 143),
('Крым', 'KRY', 144),
('Севастополь', 'Россия', 145),
('Костромская область', 'OMS', 146),
('Удмуртия респ.', 'UD', 147),
('Мордовия респ.', 'MO', 148),
('Костромская обл.', 'OMS', 149),
('Ненецкий автономный округ', 'NEN', 150),
('Республика Коми', 'KO', 151),
('Новгородская обл.', 'NGR', 152),
('Ингушетия респ.', 'IN', 153),
('Калмыкия респ.', 'KL', 154),
('Ивановская обл.', 'IVA', 155),
('Тульская обл.', 'TUL', 156),
('Тыва респ.', 'TY', 157),
('Республика Тыва', 'TY', 158),
('Чукотский авт. округ', 'CHU', 159),
('Ханты-Мансийский авт. округ - Югра', 'KHM', 160),
('Байконур', 'Россия', 161);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `cscart_oblast`
--
ALTER TABLE `cscart_oblast`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `cscart_oblast`
--
ALTER TABLE `cscart_oblast`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=162;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
